const constitutionData = {
    "전문": [
        {
            "title": "대한민국 헌법 전문",
            "content": ["유구한 역사와 전통에 빛나는 우리 대한국민은 3·1운동으로 건립된 대한민국 임시정부의 법통과 불의에 항거한 4·19민주이념을 계승하고, 조국의 민주개혁과 {0}의 사명에 입각하여 정의·인도와 동포애로써 민족의 단결을 공고히 하고, 모든 사회적 {1}와/과 {2}을/를 타파하며, 자율과 조화를 바탕으로 자유민주적 기본질서를 더욱 확고히 하여 정치·경제·사회·문화의 모든 영역에 있어서 각인의 기회를 {3} 하고, 능력을 최고도로 발휘하게 하며, {4}와/과 {5}에 따르는 책임과 의무를 완수하게 하여, 안으로는 국민생활의 균등한 향상을 기하고 밖으로는 항구적인 {6}와/과 {7}에 이바지함으로써 우리들과 우리들의 자손의 안전과 {4}와/과 행복을 영원히 확보할 것을 다짐하면서 1948년 7월 12일에 제정되고 8차에 걸쳐 개정된 헌법을 이제 {8}의 의결을 거쳐 {9}에 의하여 개정한다."
                ,"/ 1987년 10월 29일"],
            "answers": ["평화적 통일","폐습","불의","균등히","자유","권리","세계평화","인류공영","국회","국민투표"]
        }
    ],
    "총강(제1조~제9조)": [
        {
            "title": "헌법 제1조",
            "content": ["① 대한민국은 {0}(이)다.", "② 대한민국의 주권은 {1}에게 있고, 모든 권력은 {1}(으)로부터 나온다."],
            "answers": ["민주공화국", "국민"]
        },
        {
            "title": "헌법 제2조",
            "content": ["① 대한민국의 국민이 되는 요건은 {0}(으)로 정한다.", "② 국가는 법률이 정하는 바에 의하여 {1}을/를 {2}할 의무를 진다."],
            "answers": ["법률", "재외국민", "보호"]
        },
        {
            "title": "헌법 제3조",
            "content": ["대한민국의 영토는 {0}와 그 {1}(으)로 한다."],
            "answers": ["한반도", "부속도서"]
        },
        {
            "title": "헌법 제4조",
            "content": ["대한민국은 {0}을/를 지향하며, {1} 기본질서에 입각한 {2} 정책을 수립하고 이를 추진한다."],
            "answers": ["통일", "자유민주적", "평화적 통일"]
        },
        {
            "title": "헌법 제5조",
            "content": ["① 대한민국은 {0}의 유지에 노력하고 {1} 전쟁을 부인한다.", "② 국군은 국가의 {2}과 국토방위의 신성한 의무를 수행함을 사명으로 하며, 그 {3}은 준수된다."],
            "answers": ["국제평화", "침략적", "안전보장", "정치적 중립성"]
        },
        {
            "title": "헌법 제6조",
            "content": ["① {0}에 의하여 {1}·{2}된 조약과 일반적으로 승인된 {3}은/는 {4}와/과 같은 효력을 지닌다.", "② 외국인은 {5}와/과 조약이 정하는 바에 의하여 그 {6}(이)가 보장된다."],
            "answers": ["헌법", "체결", "공포", "국제법규", "국내법", "국제법", "지위"]
        },
        {
            "title": "헌법 제7조",
            "content": ["① 공무원은 {0}에 대한 봉사자이며, {1}에 대하여 책임을 진다.", "② 공무원의 신분과 {2}은/는 {3}이/가 정하는 바에 의하여 보장된다."],
            "answers": ["국민전체", "국민", "정치적 중립성", "법률"]
        },
        {
            "title": "헌법 제8조",
            "content": ["① 정당의 설립은 자유이며, {0}은/는 보장된다.", "② 정당은 그 목적·조직과 활동이 {1}이어야 하며, 국민의 {2}에 참여하는데 필요한 조직을 가져야 한다.", 
                "③ 정당은 법률이 정하는 바에 의하여 {3}의 보호를 받으며, {3}는 법률이 정하는 바에 의하여 정당 운영에 필요한 자금을 보조할 수 있다.",
                "④ 정당의 목적이나 활동이 {1} 기본질서에 위배될 때에는 {4}는 {5}에 그 해산을 제소할 수 있고, 정당은 {5}의 심판에 의하여 해산된다."],
            "answers": ["복수정당제", "민주적", "정치적 의사형성", "국가", "정부", "헌법재판소"]
        },
        {
            "title": "헌법 제9조",
            "content": ["국가는 {0}의 계승·발전과 {1}의 창달에 노력하여야 한다."],
            "answers": ["전통문화", "민족문화"]
        },
    ],
    "국민의 권리와 의무(제10조~제39조)": [
        {
            "title": "헌법 제10조",
            "content": ["모든 국민은 {0}(으)로서의 {1}와/과 {2}을/를 가지며, {3}할 권리를 가진다. 국가는 개인이 가지는 {4}의 기본적 인권을 확인하고 이를 {5}를 진다."],
            "answers": ["인간","존엄","가치","행복을 추구","불가침","보장할 의무"]
        },
        {
            "title": "헌법 제11조",
            "content": ["① 모든 국민은 법 앞에 {0}하다. 누구든지 성별·종교 또는 {1}에 의하여 정치적·경제적·사회적·문화적 생활의 모든 영역에 있어서 {2}을/를 받지 아니한다.",
                "② 사회적 {3}의 제도는 인정되지 아니하며, 어떠한 형태로도 이를 창설할 수 없다.",
                "③ 훈장 등의 {4}은/는 이를 받은 자에게만 효력이 있고, 어떠한 {5}도 이에 따르지 아니한다."
            ],
            "answers": ["평등","사회적 신분","차별","특수계급","영전","특권"]
        },
        {
            "title": "헌법 제12조",
            "content": ["① 모든 국민은 {0}을/를 가진다. 누구든지 법률에 의하지 아니하고는 체포ㆍ구속ㆍ압수ㆍ수색 또는 심문을 받지 아니하며, 법률과 적법한 절차에 의하지 아니하고는 {1}ㆍ{2} 또는 강제노역을 받지 아니한다.",
                "② 모든 국민은 {3}을/를 받지 아니하며, 형사상 자기에게 {4}을/를 강요당하지 아니한다.",
                "③ 체포ㆍ구속ㆍ압수 또는 수색을 할 때에는 적법한 절차에 따라 {5}의 신청에 의하여 {6}이/가 발부한 영장을 제시하여야 한다. 다만, {7}인 경우와 {8} 이상의 형에 해당하는 죄를 범하고 {9} 또는 {10}의 염려가 있을 때에는 사후에 영장을 청구할 수 있다.",
                "④ 누구든지 체포 또는 구속을 당한 때에는 즉시 {11}의 조력을 받을 권리를 가진다. 다만, {12}이/가 스스로 {11}을/를 구할 수 없을 때에는 법률이 정하는 바에 의하여 국가가 변호인을 붙인다.",
                "⑤ 누구든지 체포 또는 구속의 이유와 {11}의 조력을 받을 권리가 있음을 고지받지 아니하고는 체포 또는 구속을 당하지 아니한다. 체포 또는 구속을 당한 자의 가족등 법률이 정하는 자에게는 그 이유와 일시ㆍ장소가 {13} 통지되어야 한다.",
                "⑥ 누구든지 체포 또는 구속을 당한 때에는 {14}의 심사를 {15}에 청구할 권리를 가진다.",
                "⑦ 피고인의 자백이 고문ㆍ폭행ㆍ협박ㆍ구속의 부당한 장기화 또는 기망 기타의 방법에 의하여 {16}로 진술된 것이 아니라고 인정될 때 또는 정식재판에 있어서 피고인의 자백이 그에게 불리한 {17} 증거일 때에는 이를 유죄의 증거로 삼거나 이를 이유로 처벌할 수 없다."
            ],
            "answers": ["신체의 자유","처벌","보안처분","고문","불리한 진술","검사","법관","현행범인","장기 3년","도피","증거인멸","변호인","형사피고인","지체없이","적부","법원","자의","유일한"]
        },
        {
            "title": "헌법 제13조",
            "content": ["① 모든 국민은 {0}에 의하여 범죄를 구성하지 아니하는 행위로 소추되지 아니하며, {1} 범죄에 대하여 {2} 처벌받지 아니한다.",
                "② 모든 국민은 {3}에 의하여 참정권의 제한을 받거나 재산권을 박탈당하지 아니한다.",
                "③ 모든 국민은 자기의 행위가 아닌 {4}의 행위로 인하여 불이익한 처우를 받지 아니한다."
            ],
            "answers": ["행위시의 법률","동일한","거듭","소급입법","친족"]
        },
        {
            "title": "헌법 제14조",
            "content": ["모든 국민은 {0}ㆍ{1}의 자유를 가진다."],
            "answers": ["거주","이전"]
        },
        {
            "title": "헌법 제15조",
            "content": ["모든 국민은 {0}선택의 자유를 가진다."],
            "answers": ["직업"]
        },
        {
            "title": "헌법 제16조",
            "content": ["모든 국민은 {0}의 자유를 침해받지 아니한다. {0}에 대한 압수나 수색을 할 때에는 {1}의 신청에 의하여 {2}이/가 발부한 영장을 제시하여야 한다."],
            "answers": ["주거","검사","법관"]
        },
        {
            "title": "헌법 제17조",
            "content": ["모든 국민은 {0}의 비밀과 자유를 침해받지 아니한다."],
            "answers": ["사생활"]
        },
        {
            "title": "헌법 제18조",
            "content": ["모든 국민은 {0}의 비밀을 침해받지 아니한다."],
            "answers": ["통신"]
        },
        {
            "title": "헌법 제19조",
            "content": ["모든 국민은 {0}의 자유를 가진다."],
            "answers": ["양심"]
        },
        {
            "title": "헌법 제20조",
            "content": ["① 모든 국민은 {0}의 자유를 가진다.",
                "② {1}는 인정되지 아니하며, {0}와/과 {2}은/는 분리된다."],
            "answers": ["종교","국교","정치"]
        },
        {
            "title": "헌법 제21조",
            "content": ["① 모든 국민은 {0}ㆍ{1}의 자유와 {2}ㆍ{3}의 자유를 가진다.",
                "② {0}ㆍ{1}에 대한 허가나 검열과 {2}ㆍ{3}에 대한 허가는 인정되지 아니한다.",
                "③ 통신ㆍ방송의 시설기준과 신문의 기능을 보장하기 위하여 필요한 사항은 법률로 정한다.",
                "④ {0}ㆍ{1}은/는 타인의 명예나 권리 또는 {4}(이)나 {5}을/를 침해하여서는 아니된다. 언론ㆍ출판이 타인의 명예나 권리를 침해한 때에는 피해자는 이에 대한 피해의 {6}을/를 청구할 수 있다."],
            "answers": ["언론","출판","집회","결사","공중도덕","사회윤리","배상"]
        },
        {
            "title": "헌법 제22조",
            "content": ["① 모든 국민은 {0}와/과 {1}의 자유를 가진다.",
                "② 저작자ㆍ발명가ㆍ과학기술자와 예술가의 권리는 법률로써 보호한다."],
            "answers": ["학문","예술"]
        },
        {
            "title": "헌법 제23조",
            "content": ["① 모든 국민의 {0}은/는 보장된다. 그 내용과 한계는 {1}(으)로 정한다.",
                "② {0}의 행사는 {2}에 적합하도록 하여야 한다.",
                "③ {3}에 의한 {0}의 수용ㆍ사용 또는 제한 및 그에 대한 {4}은/는 법률로써 하되, 정당한 {4}을/를 지급하여야 한다."],
            "answers": ["재산권","법률","공공복리","공공필요","보상"]
        },
        {
            "title": "헌법 제24조",
            "content": ["모든 국민은 법률이 정하는 바에 의하여 {0}을/를 가진다."],
            "answers": ["선거권"]
        },
        {
            "title": "헌법 제25조",
            "content": ["모든 국민은 법률이 정하는 바에 의하여 {0}을/를 가진다."],
            "answers": ["공무담임권"]
        },
        {
            "title": "헌법 제26조",
            "content": ["① 모든 국민은 법률이 정하는 바에 의하여 국가기관에 {0}(으)로 {1}할 권리를 가진다.",
                "② 국가는 {1}에 대하여 심사할 {2}을/를 진다."],
            "answers": ["문서","청원","심사"]
        },
        {
            "title": "헌법 제27조",
            "content": ["① 모든 국민은 헌법과 법률이 정한 {0}에 의하여 법률에 의한 {1}을/를 받을 권리를 가진다.",
                "② {2} 또는 {3}이/가 아닌 국민은 대한민국의 영역 안에서는 중대한 군사상 기밀ㆍ초병ㆍ초소ㆍ유독음식물공급ㆍ포로ㆍ군용물에 관한 죄중 법률이 정한 경우와 {4}이/가 선포된 경우를 제외하고는 {5}의 {1}을/를 받지 아니한다.",
                "③ 모든 국민은 신속한 {1}을 받을 권리를 가진다. {6}은 상당한 이유가 없는 한 지체없이 {7}을 받을 권리를 가진다.",
                "④ {6}은/는 유죄의 판결이 확정될 때까지는 {7}(으)로 추정된다.",
                "⑤ {8}은/는 법률이 정하는 바에 의하여 당해 사건의 재판절차에서 진술할 수 있다."],
            "answers": ["법관","재판","군인","군무원","비상계엄","군사법원","형사피고인","공개재판","무죄","형사피해자"]
        },
        {
            "title": "헌법 제28조",
            "content": ["{0} 또는 {1}(으)로서 구금되었던 자가 법률이 정하는 {2}을/를 받거나 {3}판결을 받은 때에는 법률이 정하는 바에 의하여 국가에 정당한 {4}을/를 청구할 수 있다."],
            "answers": ["형사피의자","형사피고인","불기소처분","무죄","보상"]
        },
        {
            "title": "헌법 제29조",
            "content": ["① 공무원의 직무상 {0}(으)로 손해를 받은 국민은 법률이 정하는 바에 의하여 국가 또는 공공단체에 정당한 {1}을/를 청구할 수 있다. 이 경우 공무원 자신의 책임은 {2}되지 아니한다.",
                "② 군인ㆍ군무원ㆍ경찰공무원 기타 법률이 정하는 자가 전투ㆍ훈련등 직무집행과 관련하여 받은 손해에 대하여는 법률이 정하는 {3} 외에 국가 또는 공공단체에 공무원의 직무상 불법행위로 인한 {1}은/는 청구할 수 없다."],
            "answers": ["불법행위","배상","면제","보상"]
        },
        {
            "title": "헌법 제30조",
            "content": ["타인의 {0}(으)로 인하여 {1}ㆍ{2}에 대한 피해를 받은 국민은 법률이 정하는 바에 의하여 국가로부터 {3}를 받을 수 있다."],
            "answers": ["범죄행위","생명","신체","구조"]
        },
        {
            "title": "헌법 제31조",
            "content": ["① 모든 국민은 {0}에 따라 균등하게 {1}을/를 받을 권리를 가진다.",
                "② 모든 국민은 그 보호하는 자녀에게 적어도 {2}과 법률이 정하는 교육을 받게 할 의무를 진다.",
                "③ {3}은/는 무상으로 한다.",
                "④ 교육의 {4}ㆍ{5}ㆍ{6} 및 대학의 {7}은 법률이 정하는 바에 의하여 보장된다.",
                "⑤ 국가는 {8}을/를 진흥하여야 한다.",
                "⑥ 학교교육 및 {8}을/를 포함한 교육제도와 그 운영, 교육재정 및 교원의 지위에 관한 기본적인 사항은 법률로 정한다."],
            "answers": ["능력","교육","초등교육","의무교육","자주성","전문성","정치적 중립성","자율성","평생교육"]
        },
        {
            "title": "헌법 제32조",
            "content": ["① 모든 국민은 {0}의 권리를 가진다. 국가는 사회적ㆍ경제적 방법으로 {1}의 {2}의 증진과 {3}의 보장에 노력하여야 하며, 법률이 정하는 바에 의하여 {4}를 시행하여야 한다.",
                "② 모든 국민은 {0}의 의무를 진다. 국가는 {0}의 의무의 내용과 조건을 민주주의원칙에 따라 법률로 정한다.",
                "③ 근로조건의 기준은 인간의 {5}을 보장하도록 법률로 정한다.",
                "④ {6}의 근로는 특별한 보호를 받으며, 고용ㆍ임금 및 근로조건에 있어서 부당한 차별을 받지 아니한다.",
                "⑤ {7}의 근로는 특별한 보호를 받는다.",
                "⑥ 국가유공자ㆍ상이군경 및 전몰군경의 유가족은 법률이 정하는 바에 의하여 우선적으로 {0}의 기회를 부여받는다."],
            "answers": ["근로","근로자","고용","적정임금","최저임금제","존엄성","여자","연소자"]
        },
        {
            "title": "헌법 제33조",
            "content": ["① 근로자는 {0}의 향상을 위하여 자주적인 {1}ㆍ{2} 및 {3}을/를 가진다.",
                "② {5}인 근로자는 법률이 정하는 자에 한하여 {1}ㆍ{2} 및 {3}을/를 가진다.",
                "③ 법률이 정하는 {4}에 종사하는 근로자의 {3}은/는 법률이 정하는 바에 의하여 이를 제한하거나 인정하지 아니할 수 있다."],
            "answers": ["근로조건","단결권","단체교섭권","단체행동권","주요방위산업체","공무원"]
        },
        {
            "title": "헌법 제34조",
            "content": ["① 모든 국민은 {0}을/를 할 권리를 가진다.",
                "② 국가는 {1}ㆍ{2}의 증진에 노력할 의무를 진다.",
                "③ 국가는 {3}의 복지와 권익의 향상을 위하여 노력하여야 한다.",
                "④ 국가는 {4}와/과 {5}의 복지향상을 위한 정책을 실시할 의무를 진다.",
                "⑤ 신체장애자 및 질병ㆍ노령 기타의 사유로 {6}이/가 없는 국민은 법률이 정하는 바에 의하여 국가의 보호를 받는다.",
                "⑥ 국가는 {7}을/를 예방하고 그 위험으로부터 국민을 보호하기 위하여 노력하여야 한다."],
            "answers": ["인간다운 생활","사회보장","사회복지","여자","노인","청소년","생활능력","재해"]
        },
        {
            "title": "헌법 제35조",
            "content": ["① 모든 국민은 건강하고 {0}에서 생활할 권리를 가지며, 국가와 국민은 {1}을/를 위하여 노력하여야 한다.",
                "② {2}의 내용과 행사에 관하여는 법률로 정한다.",
                "③ 국가는 주택개발정책등을 통하여 모든 국민이 쾌적한 {3}을/를 할 수 있도록 노력하여야 한다."],
            "answers": ["쾌적한 환경","환경보전","환경권","주거생활"]
        },
        {
            "title": "헌법 제36조",
            "content": ["① 혼인과 가족생활은 {0}와/과 {1}을/를 기초로 성립되고 유지되어야 하며, 국가는 이를 보장한다.",
                "② 국가는 {2}의 보호를 위하여 노력하여야 한다.",
                "③ 모든 국민은 {3}에 관하여 국가의 보호를 받는다."],
            "answers": ["개인의 존엄","양성의 평등","모성","보건"]
        },
        {
            "title": "헌법 제37조",
            "content": ["① 국민의 {0}와/과 {1}은/는 헌법에 열거되지 아니한 이유로 경시되지 아니한다.",
                "② 국민의 모든 {0}와/과 {1}은/는 {2}ㆍ{3} 또는 {4}을/를 위하여 필요한 경우에 한하여 {5}로써 제한할 수 있으며, 제한하는 경우에도 {0}와/과 {1}의 {6}인 내용을 침해할 수 없다."],
            "answers": ["자유","권리","국가안전보장","질서유지","공공복리","법률","본질적"]
        },
        {
            "title": "헌법 제38조",
            "content": ["모든 국민은 법률이 정하는 바에 의하여 {0}의 의무를 진다."],
            "answers": ["납세"]
        },
        {
            "title": "헌법 제39조",
            "content": ["① 모든 국민은 법률이 정하는 바에 의하여 {0}의 의무를 진다.",
                "② 누구든지 {1}의 이행으로 인하여 불이익한 처우를 받지 아니한다."],
            "answers": ["국방","병역의무"]
        }

    ],
    "국회(제40조~제65조)": [
        {
            "title": "헌법 제40조",
            "content": ["입법권은 {0}에 속한다."],
            "answers": ["국회"]
        },
        {
            "title": "헌법 제41조",
            "content": ["① 국회는 국민의 {0}ㆍ{1}ㆍ{2}ㆍ{3}선거에 의하여 선출된 국회의원으로 구성한다.",
                "② 국회의원의 수는 법률로 정하되, {4} 이상으로 한다.",
                "③ 국회의원의 선거구와 비례대표제 기타 선거에 관한 사항은 법률로 정한다."
            ],
            "answers": ["보통","평등","직접","비밀","200인"]
        },
        {
            "title": "헌법 제42조",
            "content": ["국회의원의 임기는 {0}으로 한다."],
            "answers": ["4년"]
        },
        {
            "title": "헌법 제43조",
            "content": ["국회의원은 {0}을/를 겸할 수 없다."],
            "answers": ["법률이 정하는 직"]
        },
        {
            "title": "헌법 제44조",
            "content": ["① 국회의원은 {0}인 경우를 제외하고는 회기 중 {3}의 동의없이 {1} 또는 {2}되지 아니한다.",
                "② 국회의원이 회기 전에 {1} 또는 {2}된 때에는 {0}이 아닌 한 {3}의 요구가 있으면 회기 중 {4}된다."
            ],
            "answers": ["현행범인","체포","구금","국회","석방"]
        },
        {
            "title": "헌법 제45조",
            "content": ["국회의원은 국회에서 직무상 행한 {0}와/과 {1}에 관하여 {2}에서 책임을 지지 아니한다."],
            "answers": ["발언","표결","국회 외"]
        },
        {
            "title": "헌법 제46조",
            "content": ["① 국회의원은 {0}의 의무가 있다.",
                "② 국회의원은 {1}을/를 우선하여 {2}에 따라 직무를 행한다.",
                "③ 국회의원은 그 {3}을/를 {4}하여 국가ㆍ공공단체 또는 기업체와의 계약이나 그 처분에 의하여 재산상의 권리ㆍ이익 또는 {3}을/를 {5}하거나 타인을 위하여 그 {5}을/를 알선할 수 없다."
            ],
            "answers": ["청렴","국가이익","양심","지위","남용","취득"]
        },
        {
            "title": "헌법 제47조",
            "content": ["① 국회의 {0}는 법률이 정하는 바에 의하여 매년 1회 집회되며, 국회의 {1}는 {2} 또는 {3} 이상의 요구에 의하여 집회된다.",
                "② {0}의 회기는 100일을, {1}의 회기는 30일을 초과할 수 없다.",
                "③ 대통령이 {1}의 집회를 요구할 때에는 {4}과 {5}의 이유를 명시하여야 한다."
            ],
            "answers": ["정기회","임시회","대통령","국회재적의원 4분의 1","기간","집회요구"]
        },
        {
            "title": "헌법 제48조",
            "content": ["국회는 {0} 1인과 {1} 2인을 선출한다."],
            "answers": ["의장","부의장"]
        },
        {
            "title": "헌법 제49조",
            "content": ["국회는 헌법 또는 법률에 특별한 규정이 없는 한 {0}의 출석과 {1}의 찬성으로 의결한다. {2}인 때에는 부결된 것으로 본다."],
            "answers": ["재적의원 과반수","출석의원 과반수","가부동수"]
        },
        {
            "title": "헌법 제50조",
            "content": ["① 국회의 회의는 {0}한다. 다만, {1}의 찬성이 있거나 의장이 국가의 {2}을 위하여 필요하다고 인정할 때에는 {0}하지 아니할 수 있다.",
                "② {0}하지 아니한 회의내용의 공표에 관하여는 법률이 정하는 바에 의한다."
            ],
            "answers": ["공개","출석의원 과반수","안전보장"]
        },
        {
            "title": "헌법 제51조",
            "content": ["국회에 제출된 {0} 기타의 의안은 회기 중에 의결되지 못한 이유로 {1}되지 아니한다. 다만, 국회의원의 {2}가 만료된 때에는 그러하지 아니하다."],
            "answers": ["법률안","폐기","임기"]
        },
        {
            "title": "헌법 제52조",
            "content": ["{0}과 {1}는 법률안을 제출할 수 있다."],
            "answers": ["국회의원", "정부"]
        },
        {
            "title": "헌법 제53조",
            "content": ["① 국회에서 의결된 {0}은/는 정부에 이송되어 {1} 이내에 {7}이 공포한다.",
                "② {0}에 {2}가 있을 때에는 대통령은 제1항의 기간내에 {3}를 붙여 국회로 환부하고, 그 {4}를 요구할 수 있다. 국회의 폐회 중에도 또한 같다.",
                "③ {7}은/는 {0}의 일부에 대하여 또는 {0}을/를 수정하여 {4}를 요구할 수 없다.",
                "④ {4}의 요구가 있을 때에는 국회는 {4}에 붙이고, {5}의 출석과 {6} 이상의 찬성으로 전과 같은 의결을 하면 그 {0}은/는 법률로서 확정된다.",
                "⑤ {7}이/가 제1항의 기간 내에 공포나 {4}의 요구를 하지 아니한 때에도 그 {0}은/는 법률로서 확정된다.",
                "⑥ {7}은/는 제4항과 제5항의 규정에 의하여 확정된 법률을 지체없이 공포하여야 한다. 제5항에 의하여 법률이 확정된 후 또는 제4항에 의한 확정법률이 정부에 이송된 후 5일 이내에 {7}이/가 공포하지 아니할 때에는 {8}이/가 이를 공포한다.",
                "⑦ 법률은 특별한 규정이 없는 한 공포한 날로부터 {8}을 경과함으로써 효력을 발생한다."
            ],
            "answers": ["법률안","15일","이의","이의서","재의","재적의원 과반수","출석의원 3분의 2","대통령","20일","국회의장"]
        },
        {
            "title": "헌법 제54조",
            "content": ["① 국회는 국가의 {0}을/를 심의ㆍ확정한다.",
                "② 정부는 {1}마다 {0}을/를 편성하여 {1} 개시 90일 전까지 국회에 제출하고, 국회는 회계연도 개시 30일 전까지 이를 의결하여야 한다.",
                "③ 새로운 {1}이/가 개시될 때까지 예산안이 의결되지 못한 때에는 정부는 국회에서 {0}이/가 의결될 때까지 다음의 목적을 위한 경비는 {2}에 준하여 집행할 수 있다.",
                "1. 헌법이나 법률에 의하여 설치된 기관 또는 시설의 유지ㆍ운영",
                "2. 법률상 지출의무의 이행",
                "3. 이미 예산으로 승인된 사업의 계속"
            ],
            "answers": ["예산안","회계연도","전년도 예산"]
        },
        {
            "title": "헌법 제55조",
            "content": ["① 한 회계연도를 넘어 계속하여 지출할 필요가 있을 때에는 정부는 연한을 정하여 {0}로서 국회의 의결을 얻어야 한다.",
                "② {1}은/는 총액으로 국회의 의결을 얻어야 한다. {1}의 지출은 {2}의 승인을 얻어야 한다."
            ],
            "answers": ["계속비","예비비","차기국회"]
        },
        {
            "title": "헌법 제56조",
            "content": ["{0}은/는 {1}에 변경을 가할 필요가 있을 때에는 {2}을/를 편성하여 {3}에 제출할 수 있다."],
            "answers": ["정부","예산","추가경정예산안","국회"]
        },
        {
            "title": "헌법 제57조",
            "content": ["{0}은/는 {1}의 동의 없이 정부가 제출한 지출예산 각항의 금액을 {2}하거나 새 {3}을/를 설치할 수 없다."],
            "answers": ["국회","정부","증가","비목"]
        },
        {
            "title": "헌법 제58조",
            "content": ["{0}을/를 모집하거나 예산 외에 국가의 부담이 될 {1}을/를 체결하려 할 때에는 {2}은/는 미리 {3}의 {4}을/를 얻어야 한다."],
            "answers": ["국채","계약","정부","국회","의결"]
        },
        {
            "title": "헌법 제59조",
            "content": ["{0}의 종목과 세율은 법률로 정한다."],
            "answers": ["조세"]
        },
        {
            "title": "헌법 제60조",
            "content": ["① 국회는 상호원조 또는 안전보장에 관한 조약, 중요한 국제조직에 관한 조약, 우호통상항해조약, 주권의 제약에 관한 조약, 강화조약, 국가나 국민에게 중대한 재정적 부담을 지우는 조약 또는 입법사항에 관한 조약의 체결ㆍ비준에 대한 {0}을/를 가진다.",
                "② 국회는 {1}, 국군의 외국에의 {2} 또는 외국군대의 대한민국 영역 안에서의 {3}에 대한 동의권을 가진다."
            ],
            "answers": ["동의권","선전포고","파견","주류"]
        },
        {
            "title": "헌법 제61조",
            "content": ["① 국회는 {0}을/를 {1}하거나 특정한 {2}에 대하여 조사할 수 있으며, 이에 필요한 서류의 제출 또는 증인의 {3}와/과 {4}(이)나 {5}의 진술을 요구할 수 있다.",
                "② {6} 및 {7}에 관한 절차 기타 필요한 사항은 법률로 정한다."
            ],
            "answers": ["국정","감사","국정사안","출석","증언","의견","국정감사","조사"]
        },
        {
            "title": "헌법 제62조",
            "content": ["① {0}ㆍ{1} 또는 {2}은/는 국회나 그 위원회에 출석하여 {3}을 보고하거나 의견을 진술하고 질문에 응답할 수 있다.",
                "② 국회나 그 위원회의 요구가 있을 때에는 {0}ㆍ{1} 또는 {2}은/는 출석ㆍ답변하여야 하며, {0} 또는 {1}이 출석요구를 받은 때에는 {1} 또는 {2}(으)로 하여금 출석ㆍ답변하게 할 수 있다."
            ],
            "answers": ["국무총리","국무위원","정부위원","국정처리상황"]
        },
        {
            "title": "헌법 제63조",
            "content": ["① 국회는 {0} 또는 {1}의 {2}을 {3}에게 건의할 수 있다.",
                "② 제1항의 {2}건의는 {4} 이상의 발의에 의하여 {5}의 찬성이 있어야 한다."
            ],
            "answers": ["국무총리","국무위원","해임","대통령","국회재적의원 3분의 1","국회재적의원 과반수"]
        },
        {
            "title": "헌법 제64조",
            "content": ["① 국회는 법률에 저촉되지 아니하는 범위 안에서 {0}와 {1}에 관한 규칙을 제정할 수 있다.",
                "② 국회는 의원의 자격을 심사하며, 의원을 징계할 수 있다.",
                "③ 의원을 제명하려면 {2} 이상의 찬성이 있어야 한다.",
                "④ 제2항과 제3항의 처분에 대하여는 법원에 제소할 수 없다."
            ],
            "answers": ["의사","내부규율","국회재적의원 3분의 2"]
        },
        {
            "title": "헌법 제65조",
            "content": ["① 대통령ㆍ국무총리ㆍ국무위원ㆍ행정각부의 장ㆍ헌법재판소 재판관ㆍ법관ㆍ중앙선거관리위원회 위원ㆍ감사원장ㆍ감사위원 기타 법률이 정한 공무원이 그 직무집행에 있어서 헌법이나 법률을 위배한 때에는 국회는 {0}을/를 의결할 수 있다.",
                "② 제1항의 {1}은/는 {2} 이상의 발의가 있어야 하며, 그 의결은 {3}의 찬성이 있어야 한다. 다만, 대통령에 대한 {1}은/는 {3}의 발의와 {4} 이상의 찬성이 있어야 한다.",
                "③ {1}의 의결을 받은 자는 탄핵심판이 있을 때까지 그 권한행사가 {5}된다.",
                "④ 탄핵결정은 공직으로부터 파면함에 그친다. 그러나, 이에 의하여 민사상이나 형사상의 {6}이 면제되지는 아니한다."
            ],
            "answers": ["탄핵의 소추","탄핵소추","국회재적의원 3분의 1","국회재적의원 과반수","국회재적의원 3분의 2","정지","책임"]
        }
    ],
    "대통령(제66조~제85조)": [
        {
            "title": "헌법 제66조",
            "content": ["① 대통령은 국가의 {0}이며, 외국에 대하여 국가를 대표한다.",
                "② 대통령은 국가의 {1}ㆍ영토의 {2}ㆍ국가의 {3}와/과 헌법을 수호할 책무를 진다.",
                "③ 대통령은 조국의 {4}을/를 위한 성실한 의무를 진다.",
                "④ {5}은/는 대통령을 수반으로 하는 정부에 속한다."
            ],
            "answers": ["원수","독립","보전","계속성","평화적 통일","행정권"]
        },
        {
            "title": "헌법 제67조",
            "content": ["① 대통령은 국민의 {0}ㆍ{1}ㆍ{2}ㆍ{3}선거에 의하여 선출한다.",
                "② 제1항의 선거에 있어서 최고득표자가 2인 이상인 때에는 국회의 {4} 과반수가 출석한 공개회의에서 {5}을/를 얻은 자를 당선자로 한다.",
                "③ 대통령후보자가 1인일 때에는 그 득표수가 {6} 총수의 {7} 이상이 아니면 대통령으로 당선될 수 없다.",
                "④ 대통령으로 선거될 수 있는 자는 국회의원의 {8}이/가 있고 선거일 현재 {9}에 달하여야 한다.",
                "⑤ 대통령의 선거에 관한 사항은 법률로 정한다."
            ],
            "answers": ["보통","평등","직접","비밀","재적의원","다수표","선거권자","3분의 1","피선거권","40세"]
        },
        {
            "title": "헌법 제68조",
            "content": ["① 대통령의 임기가 만료되는 때에는 임기만료 70일 내지 40일 전에 후임자를 선거한다.",
                "② 대통령이 {0}된 때 또는 대통령 당선자가 {1}하거나 판결 기타의 사유로 그 자격을 {2}한 때에는 60일 이내에 후임자를 선거한다."
            ],
            "answers": ["궐위","사망","상실"]
        },
        {
            "title": "헌법 제69조",
            "content": ["대통령은 취임에 즈음하여 다음의 선서를 한다.",
                "“나는 {0}을/를 준수하고 국가를 보위하며 조국의 {1}와/과 국민의 {2}와/과 {3}의 증진 및 {4}의 창달에 노력하여 대통령으로서의 직책을 성실히 수행할 것을 국민 앞에 엄숙히 선서합니다.”"
            ],
            "answers": ["헌법","평화적 통일","자유","복리","민족문화"]
        },
        {
            "title": "헌법 제70조",
            "content": ["대통령의 임기는 {0}(으)로 하며, {1}할 수 없다."],
            "answers": ["5년","중임"]
        },
        {
            "title": "헌법 제71조",
            "content": ["대통령이 {0}되거나 사고로 인하여 직무를 수행할 수 없을 때에는 {1}, 법률이 정한 {2}의 순서로 그 권한을 대행한다."],
            "answers": ["궐위","국무총리","국무위원"]
        },
        {
            "title": "헌법 제72조",
            "content": ["대통령은 필요하다고 인정할 때에는 외교ㆍ국방ㆍ통일 기타 국가안위에 관한 중요정책을 {0}에 붙일 수 있다."],
            "answers": ["국민투표"]
        },
        {
            "title": "헌법 제73조",
            "content": ["대통령은 조약을 {0}ㆍ{1}하고, {2}을/를 신임ㆍ접수 또는 파견하며, {3}와/과 {4}을/를 한다."],
            "answers": ["체결","비준","외교사절","선전포고","강화"]
        },
        {
            "title": "헌법 제74조",
            "content": ["① 대통령은 헌법과 법률이 정하는 바에 의하여 {0}을/를 통수한다.",
                "② {0}의 조직과 편성은 법률로 정한다."
            ],
            "answers": ["국군"]
        },
        {
            "title": "헌법 제75조",
            "content": ["대통령은 법률에서 구체적으로 범위를 정하여 {0}받은 사항과 법률을 {1}하기 위하여 필요한 사항에 관하여 {2}을/를 발할 수 있다."],
            "answers": ["위임","집행","대통령령"]
        },
        {
            "title": "헌법 제76조",
            "content": ["① 대통령은 내우ㆍ외환ㆍ천재ㆍ지변 또는 중대한 재정ㆍ경제상의 위기에 있어서 국가의 {0} 또는 공공의 {1}을/를 유지하기 위하여 긴급한 조치가 필요하고 {4}의 집회를 기다릴 여유가 없을 때에 한하여 최소한으로 필요한 재정ㆍ경제상의 처분을 하거나 이에 관하여 법률의 효력을 가지는 명령을 발할 수 있다.",
                "② 대통령은 국가의 안위에 관계되는 중대한 {2}에 있어서 국가를 {3}하기 위하여 긴급한 조치가 필요하고 {4}의 집회가 불가능한 때에 한하여 법률의 효력을 가지는 명령을 발할 수 있다.",
                "③ 대통령은 제1항과 제2항의 처분 또는 명령을 한 때에는 지체없이 {4}에 보고하여 그 승인을 얻어야 한다.",
                "④ 제3항의 승인을 얻지 못한 때에는 그 처분 또는 명령은 그때부터 {5}을/를 상실한다. 이 경우 그 명령에 의하여 개정 또는 폐지되었던 법률은 그 명령이 승인을 얻지 못한 때부터 당연히 {5}을/를 회복한다.",
                "⑤ 대통령은 제3항과 제4항의 {6}을/를 지체없이 공포하여야 한다."
            ],
            "answers": ["안전보장","안녕질서","교전상태","보위","국회","효력","사유"]
        },
        {
            "title": "헌법 제77조",
            "content": ["① 대통령은 {0}ㆍ{1} 또는 이에 준하는 {2}에 있어서 병력으로써 군사상의 필요에 응하거나 공공의 {3}을/를 유지할 필요가 있을 때에는 법률이 정하는 바에 의하여 {4}을/를 선포할 수 있다.",
                "② {4}은/는 {5}와/과 {6}(으)로 한다.",
                "③ {5}이/가 선포된 때에는 법률이 정하는 바에 의하여 영장제도, 언론ㆍ출판ㆍ집회ㆍ결사의 자유, 정부나 법원의 권한에 관하여 특별한 조치를 할 수 있다.",
                "④ {4}을/를 선포한 때에는 대통령은 지체없이 {7}에 통고하여야 한다.",
                "⑤ {7}이/가 {8}의 찬성으로 {4}의 해제를 요구한 때에는 대통령은 이를 해제하여야 한다."
            ],
            "answers": ["전시","사변","국가비상사태","얀녕질서","계엄","비상계엄","경비계엄","국회","재적의원 과반수"]
        },
        {
            "title": "헌법 제78조",
            "content": ["대통령은 헌법과 법률이 정하는 바에 의하여 공무원을 {0}한다."],
            "answers": ["임면"]
        },
        {
            "title": "헌법 제79조",
            "content": ["① 대통령은 법률이 정하는 바에 의하여 {0}ㆍ{1} 또는 {2}을/를 명할 수 있다.",
                "② 일반{0}을/를 명하려면 {3}의 동의를 얻어야 한다.",
                "③ {0}ㆍ{1} 및 {2}에 관한 사항은 법률로 정한다."
            ],
            "answers": ["사면","감형","복권","국회"]
        },
        {
            "title": "헌법 제80조",
            "content": ["대통령은 법률이 정하는 바에 의하여 {0} 기타의 영전을 수여한다."],
            "answers": ["훈장"]
        },
        {
            "title": "헌법 제81조",
            "content": ["대통령은 국회에 {0}하여 {1}하거나 {3}(으)로 의견을 표시할 수 있다."],
            "answers": ["출석","발언","서한"]
        },
        {
            "title": "헌법 제82조",
            "content": ["대통령의 국법상 행위는 {0}로써 하며, 이 문서에는 {1}와/과 관계 {2}이/가 {3}한다. 군사에 관한 것도 또한 같다."],
            "answers": ["문서","국무총리","국무위원","부서"]
        },
        {
            "title": "헌법 제83조",
            "content": ["대통령은 {0}ㆍ{1}ㆍ행정각부의 장 기타 법률이 정하는 {2}의 직을 겸할 수 없다."],
            "answers": ["국무총리","국무위원","공사"]
        },
        {
            "title": "헌법 제84조",
            "content": ["대통령은 {0} 또는 {1}의 죄를 범한 경우를 제외하고는 재직 중 {2}상의 소추를 받지 아니한다."],
            "answers": ["내란","외환","형사"]
        },
        {
            "title": "헌법 제85조",
            "content": ["{0}의 신분과 예우에 관하여는 법률로 정한다."],
            "answers": ["전직대통령"]
        },
    ],
"행정부(제86조~제100조)": [
        {
            "title": "헌법 제86조",
            "content": ["① 국무총리는 {0}의 동의를 얻어 대통령이 임명한다.",
                "② 국무총리는 대통령을 보좌하며, 행정에 관하여 대통령의 명을 받아 {1}을/를 통할한다.",
                "③ {2}은/는 현역을 면한 후가 아니면 국무총리로 임명될 수 없다."
            ],
            "answers": ["국회","행정각부","군인"]
        },
        {
            "title": "헌법 제87조",
            "content": ["① 국무위원은 {0}의 제청으로 대통령이 임명한다.",
                "② 국무위원은 국정에 관하여 대통령을 보좌하며, {1}의 구성원으로서 국정을 {2}한다.",
                "③ 국무총리는 국무위원의 {3}을/를 대통령에게 건의할 수 있다.",
                "④ {4}은/는 현역을 면한 후가 아니면 국무위원으로 임명될 수 없다."
            ],
            "answers": ["국무총리","국무회의","심의","해임","군인"]
        },
        {
            "title": "헌법 제88조",
            "content": ["① {0}은/는 정부의 권한에 속하는 중요한 정책을 심의한다.",
                "② {0}은/는 {1}ㆍ{2}와 15인 이상 30인 이하의 {3}(으)로 구성한다.",
                "③ {1}은/는 {0}의 의장이 되고, {2}은/는 부의장이 된다."
            ],
            "answers": ["국무회의","대통령","국무총리","국무위원"]
        },
        {
            "title": "헌법 제89조",
            "content": ["다음 사항은 국무회의의 심의를 거쳐야 한다.",
                "1. 국정의 기본계획과 정부의 {0}정책",
                "2. 선전ㆍ강화 기타 중요한 {1}정책",
                "3. 헌법개정안ㆍ국민투표안ㆍ조약안ㆍ법률안 및 대통령령안",
                "4. 예산안ㆍ결산ㆍ국유재산처분의 기본계획ㆍ국가의 부담이 될 계약 기타 {2}에 관한 중요사항",
                "5. 대통령의 {3}ㆍ긴급재정경제처분 및 명령 또는 계엄과 그 해제",
                "6. 군사에 관한 중요사항",
                "7. 국회의 {4} 집회의 요구",
                "8. 영전수여",
                "9. 사면ㆍ감형과 복권",
                "10. 행정각부간의 권한의 획정",
                "11. 정부 안의 권한의 위임 또는 배정에 관한 기본계획",
                "12. 국정처리상황의 평가ㆍ분석",
                "13. 행정각부의 중요한 정책의 수립과 조정",
                "14. {5}의 제소",
                "15. 정부에 제출 또는 회부된 정부의 정책에 관계되는 {6}의 심사",
                "16. 검찰총장ㆍ합동참모의장ㆍ각군참모총장ㆍ국립대학교총장ㆍ대사 기타 법률이 정한 공무원과 국영기업체관리자의 임명",
                "17. 기타 대통령ㆍ국무총리 또는 국무위원이 제출한 사항"
            ],
            "answers": ["일반","대외","재정","긴급명령","임시회","정당해산","청원"]
        },
        {
            "title": "헌법 제90조",
            "content": ["① 국정의 중요한 사항에 관한 대통령의 {0}에 응하기 위하여 국가원로로 구성되는 {1}을/를 둘 수 있다.",
                "② {1}의 의장은 {2}이/가 된다. 다만, {2}이/가 없을 때에는 대통령이 지명한다.",
                "③ {1}의 조직ㆍ직무범위 기타 필요한 사항은 법률로 정한다."
            ],
            "answers": ["자문","국가원로자문회의","직전대통령"]
        },
        {
            "title": "헌법 제91조",
            "content": ["① {0}에 관련되는 대외정책ㆍ군사정책과 국내정책의 수립에 관하여 국무회의의 심의에 앞서 {1}의 자문에 응하기 위하여 {0}회의를 둔다.",
                "② {0}회의는 {1}이/가 주재한다.",
                "③ {0}회의의 조직ㆍ직무범위 기타 필요한 사항은 법률로 정한다."
            ],
            "answers": ["국가안전보장","대통령"]
        },
        {
            "title": "헌법 제92조",
            "content": ["① 평화통일정책의 수립에 관한 대통령의 자문에 응하기 위하여 {0}을/를 둘 수 있다.",
                "② {0}의 조직ㆍ직무범위 기타 필요한 사항은 법률로 정한다."],
            "answers": ["민주평화통일자문회의"]
        },
        {
            "title": "헌법 제93조",
            "content": ["① {0}의 발전을 위한 중요정책의 수립에 관하여 대통령의 자문에 응하기 위하여 {0}자문회의를 둘 수 있다.",
                "② {0}자문회의의 조직ㆍ직무범위 기타 필요한 사항은 법률로 정한다."],
            "answers": ["국민경제"]
        },
        {
            "title": "헌법 제94조",
            "content": ["행정각부의 장은 {0} 중에서 {1}의 제청으로 {2}이/가 임명한다."],
            "answers": ["국무위원","국무총리","대통령"]
        },
        {
            "title": "헌법 제95조",
            "content": ["{0} 또는 {1}의 장은 소관사무에 관하여 법률이나 대통령령의 위임 또는 직권으로 {2} 또는 {3}을/를 발할 수 있다."],
            "answers": ["국무총리","행정각부","총리령","부령"]
        },
        {
            "title": "헌법 제96조",
            "content": ["행정각부의 설치ㆍ조직과 {0}은/는 법률로 정한다."],
            "answers": ["직무범위"]
        },
        {
            "title": "헌법 제97조",
            "content": ["국가의 세입ㆍ세출의 {0}, 국가 및 법률이 정한 단체의 {1}와/과 행정기관 및 공무원의 직무에 관한 {2}을/를 하기 위하여 대통령 소속하에 {3}을/를 둔다."],
            "answers": ["결산","회계검사","감찰","감사원"]
        },
        {
            "title": "헌법 제98조",
            "content": ["① 감사원은 원장을 포함한 5인 이상 11인 이하의 {0}(으)로 구성한다.",
                "② 원장은 {1}의 동의를 얻어 {2}이/가 임명하고, 그 임기는 4년으로 하며, 1차에 한하여 {3}할 수 있다.",
                "③ {0}은/는 원장의 제청으로 {2}이/가 임명하고, 그 임기는 4년으로 하며, 1차에 한하여 {3}할 수 있다."],
            "answers": ["감사위원","국회","대통령","중임"]
        },
        {
            "title": "헌법 제99조",
            "content": ["감사원은 세입ㆍ세출의 결산을 매년 {0}하여 {1}와/과 {2}에 그 결과를 보고하여야 한다."],
            "answers": ["검사","대통령","차년도국회"]
        },
        {
            "title": "헌법 제100조",
            "content": ["감사원의 조직ㆍ직무범위ㆍ감사위원의 자격ㆍ감사대상공무원의 범위 기타 필요한 사항은 {0}(으)로 정한다."],
            "answers": ["법률"]
        }
    ],
    "법원 및 헌법재판소(제101조~제113조)": [
        {
            "title": "헌법 제101조",
            "content": ["① {0}은/는 법관으로 구성된 {1}에 속한다.",
                "② {1}은/는 최고법원인 {2}와/과 {3}(으)로 조직된다.",
                "③ 법관의 자격은 법률로 정한다."],
            "answers": ["사법권","법원","대법원","각급법원"]
        },
        {
            "title": "헌법 제102조",
            "content": ["① 대법원에 {0}을/를 둘 수 있다.",
                "② 대법원에 {1}을/를 둔다. 다만, 법률이 정하는 바에 의하여 {1}이/가 아닌 {2}을/를 둘 수 있다.",
                "③ 대법원과 각급법원의 조직은 법률로 정한다."],
            "answers": ["부","대법관","법관"]
        },
        {
            "title": "헌법 제103조",
            "content": ["법관은 헌법과 법률에 의하여 그 {0}에 따라 {1}하여 심판한다."],
            "answers": ["양심","독립"]
        },
        {
            "title": "헌법 제104조",
            "content": ["① 대법원장은 {0}의 동의를 얻어 {1}이/가 임명한다.",
                "② 대법관은 {2}의 제청으로 {0}의 동의를 얻어 {1}이/가 임명한다.",
                "③ 대법원장과 대법관이 아닌 법관은 {3}의 동의를 얻어 {2}이/가 임명한다."],
            "answers": ["국회","대통령","대법원장","대법관회의"]
        },
        {
            "title": "헌법 제105조",
            "content": ["① 대법원장의 임기는 6년으로 하며, {0}할 수 없다.",
                "② 대법관의 임기는 6년으로 하며, 법률이 정하는 바에 의하여 {1}할 수 있다.",
                "③ 대법원장과 대법관이 아닌 법관의 임기는 10년으로 하며, 법률이 정하는 바에 의하여 {1}할 수 있다.",
                "④ 법관의 {2}은/는 법률로 정한다."],
            "answers": ["중임","연임","정년"]
        },
        {
            "title": "헌법 제106조",
            "content": ["① 법관은 {0} 또는 {1} 이상의 형의 선고에 의하지 아니하고는 파면되지 아니하며, {2}처분에 의하지 아니하고는 정직ㆍ감봉 기타 불리한 처분을 받지 아니한다.",
                "② 법관이 중대한 심신상의 장해로 직무를 수행할 수 없을 때에는 법률이 정하는 바에 의하여 {3}하게 할 수 있다."],
            "answers": ["탄핵","금고","징계","퇴직"]
        },
        {
            "title": "헌법 제107조",
            "content": ["① 법률이 {0}에 위반되는 여부가 재판의 {1}이/가 된 경우에는 법원은 {2}에 제청하여 그 심판에 의하여 재판한다.",
                "② 명령ㆍ규칙 또는 처분이 {0}(이)나 법률에 위반되는 여부가 재판의 {1}이/가 된 경우에는 {3}은/는 이를 최종적으로 심사할 권한을 가진다.",
                "③ 재판의 전심절차로서 {4}을/를 할 수 있다. 행정심판의 절차는 법률로 정하되, {5}이/가 준용되어야 한다."],
            "answers": ["헌법","전제","헌법재판소","대법원","행정심판","사법절차"]
        },
        {
            "title": "헌법 제108조",
            "content": ["대법원은 법률에 저촉되지 아니하는 범위 안에서 {0}에 관한 절차, 법원의 {1}와/과 사무처리에 관한 규칙을 제정할 수 있다."],
            "answers": ["소송","내부규율"]
        },
        {
            "title": "헌법 제109조",
            "content": ["재판의 {0}와/과 {1}은/는 공개한다. 다만, 심리는 국가의 {2} 또는 {3}을/를 방해하거나 {4}을/를 해할 염려가 있을 때에는 법원의 결정으로 공개하지 아니할 수 있다."],
            "answers": ["심리","판결","안전보장","안녕질서","선량한 풍속"]
        },
        {
            "title": "헌법 제110조",
            "content": ["① 군사재판을 관할하기 위하여 특별법원으로서 {0}을/를 둘 수 있다.",
                "② {0}의 상고심은 {1}에서 관할한다.",
                "③ {0}의 조직ㆍ권한 및 재판관의 자격은 법률로 정한다.",
                "④ {2}하의 군사재판은 군인ㆍ군무원의 범죄나 군사에 관한 간첩죄의 경우와 초병ㆍ초소ㆍ유독음식물공급ㆍ포로에 관한 죄 중 법률이 정한 경우에 한하여 {3}(으)로 할 수 있다. 다만, {4}을/를 선고한 경우에는 그러하지 아니하다."],
            "answers": ["군사법원","대법원","비상계엄","단심","사형"]
        },
        {
            "title": "헌법 제111조",
            "content": ["① 헌법재판소는 다음 사항을 관장한다.",
                "1. 법원의 제청에 의한 법률의 {0} 심판",
                "2. {1}의 심판",
                "3. 정당의 {2} 심판",
                "4. 국가기관 상호간, 국가기관과 지방자치단체간 및 지방자치단체 상호간의 {3}에 관한 심판",
                "5. 법률이 정하는 {4}에 관한 심판",
                "② 헌법재판소는 법관의 자격을 가진 {5}의 재판관으로 구성하며, 재판관은 {8}이/가 임명한다.",
                "③ 제2항의 재판관중 3인은 {6}에서 선출하는 자를, 3인은 {7}이/가 지명하는 자를 임명한다.",
                "④ 헌법재판소의 장은 {6}의 동의를 얻어 재판관 중에서 {8}이/가 임명한다."],
            "answers": ["위헌여부","탄핵","해산","권한쟁의","헌법소원","9인","국회","대법원장","대통령"]
        },
        {
            "title": "헌법 제112조",
            "content": ["① 헌법재판소 재판관의 임기는 6년으로 하며, 법률이 정하는 바에 의하여 {0}할 수 있다.",
                "② 헌법재판소 재판관은 {1}에 가입하거나 {2}에 관여할 수 없다.",
                "③ 헌법재판소 재판관은 {3} 또는 {4} 이상의 형의 선고에 의하지 아니하고는 파면되지 아니한다."],
            "answers": ["연임","정당","정치","탄핵","금고"]
        },
        {
            "title": "헌법 제113조",
            "content": ["① 헌법재판소에서 법률의 {0}결정, {1}의 결정, {2}의 결정 또는 {3}에 관한 인용결정을 할 때에는 재판관 6인 이상의 찬성이 있어야 한다.",
                "② 헌법재판소는 법률에 저촉되지 아니하는 범위 안에서 심판에 관한 절차, 내부규율과 사무처리에 관한 규칙을 제정할 수 있다.",
                "③ 헌법재판소의 조직과 운영 기타 필요한 사항은 법률로 정한다."],
            "answers": ["위헌","탄핵","정당해산","헌법소원"]
        }
    ],
    "선거관리 및 지방자치(제114조~제118조)": [
        {
            "title": "헌법 제114조",
            "content": ["① 선거와 국민투표의 공정한 관리 및 정당에 관한 사무를 처리하기 위하여 {0}을/를 둔다.",
                "② {1}은/는 {2}이/가 임명하는 3인, {3}에서 선출하는 3인과 {4}이/가 지명하는 3인의 위원으로 구성한다. 위원장은 위원 중에서 {5}한다.",
                "③ 위원의 임기는 6년으로 한다.",
                "④ 위원은 {6}에 가입하거나 {7}에 관여할 수 없다.",
                "⑤ 위원은 {8} 또는 {9} 이상의 형의 선고에 의하지 아니하고는 파면되지 아니한다.",
                "⑥ {1}은/는 법령의 범위 안에서 선거관리ㆍ국민투표관리 또는 정당사무에 관한 규칙을 제정할 수 있으며, 법률에 저촉되지 아니하는 범위 안에서 내부규율에 관한 규칙을 제정할 수 있다.",
                "⑦ 각급 {0}의 조직ㆍ직무범위 기타 필요한 사항은 법률로 정한다."],
            "answers": ["선거관리위원회","중앙선거관리위원회","대통령","국회","대법원장","호선","정당","정치","탄핵","금고"]
        },
        {
            "title": "헌법 제115조",
            "content": ["① 각급 선거관리위원회는 {0}의 작성 등 선거사무와 {1}에 관하여 관계 행정기관에 필요한 지시를 할 수 있다.",
                "② 제1항의 지시를 받은 당해 {2}은/는 이에 응하여야 한다."],
            "answers": ["선거인명부","국민투표사무","행정기관"]
        },
        {
            "title": "헌법 제116조",
            "content": ["① {0}은/는 각급 선거관리위원회의 관리하에 법률이 정하는 범위 안에서 하되, {1}한 기회가 보장되어야 한다.",
                "② 선거에 관한 {2}은/는 법률이 정하는 경우를 제외하고는 {3} 또는 {4}에게 부담시킬 수 없다."],
            "answers": ["선거운동","균등","경비","정당","후보자"]
        },
        {
            "title": "헌법 제117조",
            "content": ["① {0}은/는 주민의 {1}에 관한 {2}을/를 처리하고 {3}을/를 관리하며, 법령의 범위 안에서 자치에 관한 규정을 제정할 수 있다.",
                "② {0}의 종류는 법률로 정한다."],
            "answers": ["지방자치단체","복리","사무","재산"]
        },
        {
            "title": "헌법 제118조",
            "content": ["① 지방자치단체에 {0}을/를 둔다.",
                "② 지방{0}의 조직ㆍ권한ㆍ{1}선거와 지방자치단체의 장의 선임방법 기타 지방자치단체의 조직과 운영에 관한 사항은 법률로 정한다."],
            "answers": ["의회","의원"]
        }
    ],
    "경제 및 헌법개정(제119조~제130조)": [
        {
            "title": "헌법 제119조",
            "content": ["① 대한민국의 경제질서는 개인과 기업의 경제상의 {0}와/과 {1}을/를 존중함을 기본으로 한다.",
                "② 국가는 균형있는 국민경제의 성장 및 안정과 적정한 {2}의 분배를 유지하고, {3}의 지배와 {4}의 남용을 방지하며, 경제주체간의 조화를 통한 {5}을/를 위하여 경제에 관한 규제와 조정을 할 수 있다."],
            "answers": ["자유","창의","소득","시장","경제력","경제의 민주화"]
        },
        {
            "title": "헌법 제120조",
            "content": ["① 광물 기타 중요한 지하자원ㆍ수산자원ㆍ수력과 경제상 이용할 수 있는 {0}은/는 법률이 정하는 바에 의하여 일정한 기간 그 채취ㆍ개발 또는 이용을 {1}할 수 있다.",
                "② 국토와 자원은 국가의 {2}을/를 받으며, 국가는 그 {3}있는 개발과 이용을 위하여 필요한 계획을 수립한다."],
            "answers": ["자연력","특허","보호","균형"]
        },
        {
            "title": "헌법 제121조",
            "content": ["① 국가는 농지에 관하여 {0}의 원칙이 달성될 수 있도록 노력하여야 하며, 농지의 {1}은/는 금지된다.",
                "② {2}의 제고와 농지의 합리적인 이용을 위하거나 불가피한 사정으로 발생하는 농지의 {3}와/과 {4}은/는 법률이 정하는 바에 의하여 인정된다."],
            "answers": ["경자유전","소작제도","농업생산성","임대차","위탁경영"]
        },
        {
            "title": "헌법 제122조",
            "content": ["국가는 국민 모두의 생산 및 생활의 기반이 되는 {0}의 {1}이고 {2}있는 이용ㆍ개발과 보전을 위하여 법률이 정하는 바에 의하여 그에 관한 필요한 {3}와/과 {4}을/를 과할 수 있다."],
            "answers": ["국토","효율적","균형","제한","의무"]
        },
        {
            "title": "헌법 제123조",
            "content": ["① 국가는 농업 및 어업을 보호ㆍ육성하기 위하여 농ㆍ어촌종합개발과 그 지원등 필요한 계획을 수립ㆍ시행하여야 한다.",
                "② 국가는 지역간의 균형있는 발전을 위하여 지역경제를 육성할 의무를 진다.",
                "③ 국가는 중소기업을 보호ㆍ육성하여야 한다.",
                "④ 국가는 농수산물의 수급균형과 유통구조의 개선에 노력하여 가격안정을 도모함으로써 농ㆍ어민의 이익을 보호한다.",
                "⑤ 국가는 농ㆍ어민과 중소기업의 자조조직을 육성하여야 하며, 그 자율적 활동과 발전을 보장한다."],
            "answers": ["정답"]
        },
        {
            "title": "헌법 제124조",
            "content": ["국가는 건전한 소비행위를 계도하고 생산품의 품질향상을 촉구하기 위한 소비자보호운동을 법률이 정하는 바에 의하여 보장한다."],
            "answers": ["정답"]
        },
        {
            "title": "헌법 제125조",
            "content": ["국가는 대외무역을 육성하며, 이를 규제ㆍ조정할 수 있다."],
            "answers": ["정답"]
        },
        {
            "title": "헌법 제126조",
            "content": ["국방상 또는 국민경제상 긴절한 필요로 인하여 법률이 정하는 경우를 제외하고는, 사영기업을 국유 또는 공유로 이전하거나 그 경영을 통제 또는 관리할 수 없다."],
            "answers": ["정답"]
        },
        {
            "title": "헌법 제127조",
            "content": ["① 국가는 과학기술의 혁신과 정보 및 인력의 개발을 통하여 국민경제의 발전에 노력하여야 한다.",
                "② 국가는 국가표준제도를 확립한다.",
                "③ 대통령은 제1항의 목적을 달성하기 위하여 필요한 자문기구를 둘 수 있다."],
            "answers": ["정답"]
        },
        {
            "title": "헌법 제128조",
            "content": ["① 헌법개정은 국회재적의원 과반수 또는 대통령의 발의로 제안된다.",
                "② 대통령의 임기연장 또는 중임변경을 위한 헌법개정은 그 헌법개정 제안 당시의 대통령에 대하여는 효력이 없다."],
            "answers": ["정답"]
        },
        {
            "title": "헌법 제129조",
            "content": ["제안된 헌법개정안은 대통령이 20일 이상의 기간 이를 공고하여야 한다."],
            "answers": ["정답"]
        },
        {
            "title": "헌법 제130조",
            "content": ["① 국회는 헌법개정안이 공고된 날로부터 60일 이내에 의결하여야 하며, 국회의 의결은 재적의원 3분의 2 이상의 찬성을 얻어야 한다.",
                "② 헌법개정안은 국회가 의결한 후 30일 이내에 국민투표에 붙여 국회의원선거권자 과반수의 투표와 투표자 과반수의 찬성을 얻어야 한다.",
                "③ 헌법개정안이 제2항의 찬성을 얻은 때에는 헌법개정은 확정되며, 대통령은 즉시 이를 공포하여야 한다."],
            "answers": ["정답"]
        }
    ]
};